12/data/attachments/7585546aae61c04d.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_2fd3d9cc-d388-43ad-bd6b-19b33b81e3cb</nif:username>
            <nif:friendToBeAdded>Dennis_trial_Friend_12946_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>